In [2]:
import pandas as pd

# concatÏúºÎ°ú Îç∞Ïù¥ÌÑ∞ Ìï©ÏπòÍ∏∞

In [3]:
df1 = pd.DataFrame({'A': [1,3,5,7,9],
                    'B': [11,12,13,14,15],
                    'C': [0,1,2,3,4],
                    'D': [101,102,103,104,105]},
                 index = [1,2,3,4,5] )
df1

   A   B  C    D
1  1  11  0  101
2  3  12  1  102
3  5  13  2  103
4  7  14  3  104
5  9  15  4  105

In [4]:
df2 = pd.DataFrame({'A': [2,4,6,8,10],
                    'B': [1,2,3,4,5],
                    'C': [30,31,32,33,34],
                    'D': [1011,1021,1031,1041,1051]    
},
                  index = [6,7,8,9,10])
df2

     A  B   C     D
6    2  1  30  1011
7    4  2  31  1021
8    6  3  32  1031
9    8  4  33  1041
10  10  5  34  1051

In [5]:
#concat(Ïª®Ï∫£) ÏúÑÏïÑÎûòÎ°ú Î∂ôÏù¥Í∏∞ (Í∏∞Î≥∏Í∞í)
pd.concat([df1,df2])

     A   B   C     D
1    1  11   0   101
2    3  12   1   102
3    5  13   2   103
4    7  14   3   104
5    9  15   4   105
6    2   1  30  1011
7    4   2  31  1021
8    6   3  32  1031
9    8   4  33  1041
10  10   5  34  1051

In [8]:
#Î®ºÏ†Ä Ïù∏Îç±Ïä§ ÌÜµÏùº
# reset_index : Îç∞Ïù¥ÌÑ∞ÌîÑÎ†àÏûÑÏùò Ïù∏Îç±Ïä§Î•º 0,1,2,3... Î°ú Î∞îÍøîÏ§ÄÎã§. Ïù∏Îç±Ïä§Î•º 0Î∂ÄÌÑ∞ Îã§Ïãú ÏÉàÎ°ú ÎßåÎìúÎäî Ìï®ÏàòÏïº.
df1.reset_index()

   index  A   B  C    D
0      1  1  11  0  101
1      2  3  12  1  102
2      3  5  13  2  103
3      4  7  14  3  104
4      5  9  15  4  105

In [6]:
 #ÏïàÏóêÏûàÎäî Ïù∏Îç±Ïä§ Ïª¨Îüº ÎìúÎ°≠ÏúºÎ°ú ÏÇ≠Ï†ú
df1.reset_index(drop=True)

   A   B  C    D
0  1  11  0  101
1  3  12  1  102
2  5  13  2  103
3  7  14  3  104
4  9  15  4  105

In [7]:
#üîπ Í∏∞Î≥∏ Í∞úÎÖê‚úÖ 1Ô∏è‚É£ inplace=False (Í∏∞Î≥∏Í∞í)üëâ ÏõêÎ≥∏ÏùÄ Í∑∏ÎåÄÎ°ú ÎëêÍ≥†, ÏÉàÎ°úÏö¥ Í≤∞Í≥ºÎ•º Î∞òÌôò
#‚úÖ 2Ô∏è‚É£ inplace=Trueüëâ ÏõêÎ≥∏ df ÏûêÏ≤¥Î•º Î∞îÎ°ú ÏàòÏ†ï
df1.reset_index(drop=True, inplace=True)
df1

   A   B  C    D
0  1  11  0  101
1  3  12  1  102
2  5  13  2  103
3  7  14  3  104
4  9  15  4  105

In [9]:
df2.reset_index(drop=True, inplace=True)
df2

    A  B   C     D
0   2  1  30  1011
1   4  2  31  1021
2   6  3  32  1031
3   8  4  33  1041
4  10  5  34  1051

In [12]:
# concatÏúºÎ°ú Îç∞Ïù¥ÌÑ∞Î•º ÏñëÏòÜÏúºÎ°ú Ìï©ÏπòÎ†§Î©¥?? # axis=0 : Ìñâ Í¥ÄÎ†®, axis=1 : Ïó¥ Í¥ÄÎ†® (ÏóëÏãúÏä§)
# concatÏúºÎ°ú df1, df2 Îç∞Ïù¥ÌÑ∞ Ìï©ÏπòÍ∏∞
#ÌåêÎã§Ïä§ÏóêÏÑú axis ÏùòÎØ∏
#axis=0 ‚Üí Ìñâ Î∞©Ìñ• (ÏÑ∏Î°ú)
#axis=1 ‚Üí Ïó¥ Î∞©Ìñ• (Í∞ÄÎ°ú)
pd.concat([df1,df2], axis=1)

   A   B  C    D   A  B   C     D
0  1  11  0  101   2  1  30  1011
1  3  12  1  102   4  2  31  1021
2  5  13  2  103   6  3  32  1031
3  7  14  3  104   8  4  33  1041
4  9  15  4  105  10  5  34  1051

# mergeÎ°ú Îç∞Ïù¥ÌÑ∞ Ìï©ÏπòÍ∏∞

In [15]:
df3 = pd.DataFrame({'id': ['X01','X02','X03','X04','X05'],
                    'A': [1,3,5,7,9],
                    'B': [11,12,13,14,15],
                    'C': [0,1,2,3,4],
                    'D': [101,102,103,104,105] })
df3

    id  A   B  C    D
0  X01  1  11  0  101
1  X02  3  12  1  102
2  X03  5  13  2  103
3  X04  7  14  3  104
4  X05  9  15  4  105

In [16]:
df4 = pd.DataFrame({'id': ['X01','X02','X03','X04','X06'],
                    'E': [2,4,6,8,10],
                    'F': [1,2,3,4,5],
                    'G': [30,31,32,33,34],
                    'H': [1011,1021,1031,1041,1051] })
df4

    id   E  F   G     H
0  X01   2  1  30  1011
1  X02   4  2  31  1021
2  X03   6  3  32  1031
3  X04   8  4  33  1041
4  X06  10  5  34  1051

In [17]:
#merge (Î®∏ÏßÄ) Ìï©ÏπòÎã§,Î≥ëÌï©ÌïòÎã§
# on='id id Í∏∞Ï§ÄÏúºÎ°ú inner merge : Í≤πÏπòÎäî Í≤ÉÎßå Ìï©ÏπòÍ≤†Îã§ how='inner'(ÍµêÏßëÌï©)  
# df3, df4 ‚Üí Ìï©Ïπ† Îç∞Ïù¥ÌÑ∞ÌîÑÎ†àÏûÑ
# on='id' ‚Üí id Ïª¨ÎüºÏùÑ Í∏∞Ï§ÄÏúºÎ°ú Îß§Ïπ≠
# how='inner' ‚Üí ÏñëÏ™ΩÏóê Îã§ ÏûàÎäî Í∞íÎßå Ìè¨Ìï®

pd.merge(df3, df4, on='id', how='inner')

    id  A   B  C    D  E  F   G     H
0  X01  1  11  0  101  2  1  30  1011
1  X02  3  12  1  102  4  2  31  1021
2  X03  5  13  2  103  6  3  32  1031
3  X04  7  14  3  104  8  4  33  1041

In [18]:
#id Í∏∞Ï§ÄÏúºÎ°ú outer merge: Ï†ÑÎ∂Ä Îã§ Í∞ÄÏ†∏Ïò§Í≤†Îã§(Ìï©ÏßëÌï©) nan:Îç∞Ïù¥ÌÑ∞Í∞Ä ÏóÜÎã§ 
pd.merge(df3, df4, on='id', how='outer')

    id    A     B    C      D     E    F     G       H
0  X01  1.0  11.0  0.0  101.0   2.0  1.0  30.0  1011.0
1  X02  3.0  12.0  1.0  102.0   4.0  2.0  31.0  1021.0
2  X03  5.0  13.0  2.0  103.0   6.0  3.0  32.0  1031.0
3  X04  7.0  14.0  3.0  104.0   8.0  4.0  33.0  1041.0
4  X05  9.0  15.0  4.0  105.0   NaN  NaN   NaN     NaN
5  X06  NaN   NaN  NaN    NaN  10.0  5.0  34.0  1051.0

In [19]:
# left merge
# ‚úî df3Ïóê ÏûàÎäî idÎäî Îã§ ÏÇ¥ÏïÑÏûàÏùå
# ‚úî df4ÏóêÎßå ÏûàÎäî id=4Îäî ÏÇ¨ÎùºÏßê
# ‚úî ÏóÜÎäî Í∞íÏùÄ NaN
# üìå Ï¶â: ÏôºÏ™Ω Í∏∞Ï§Ä Ïú†ÏßÄ
pd.merge(df3, df4, on='id', how='left')

    id  A   B  C    D    E    F     G       H
0  X01  1  11  0  101  2.0  1.0  30.0  1011.0
1  X02  3  12  1  102  4.0  2.0  31.0  1021.0
2  X03  5  13  2  103  6.0  3.0  32.0  1031.0
3  X04  7  14  3  104  8.0  4.0  33.0  1041.0
4  X05  9  15  4  105  NaN  NaN   NaN     NaN

In [20]:
# right merge 
pd.merge(df3, df4, on='id', how='right')

    id    A     B    C      D   E  F   G     H
0  X01  1.0  11.0  0.0  101.0   2  1  30  1011
1  X02  3.0  12.0  1.0  102.0   4  2  31  1021
2  X03  5.0  13.0  2.0  103.0   6  3  32  1031
3  X04  7.0  14.0  3.0  104.0   8  4  33  1041
4  X06  NaN   NaN  NaN    NaN  10  5  34  1051

In [21]:
df5 = pd.DataFrame({'user_id': ['X01','X02','X03','X04','X06'],
                    'E': [2,4,6,8,10],
                    'F': [1,2,3,4,5],
                    'G': [30,31,32,33,34],
                    'H': [1011,1021,1031,1041,1051]    
})
df5

  user_id   E  F   G     H
0     X01   2  1  30  1011
1     X02   4  2  31  1021
2     X03   6  3  32  1031
3     X04   8  4  33  1041
4     X06  10  5  34  1051

In [22]:
# Í∏∞Ï§ÄÏù¥ ÎêòÎäî Ïª¨Îüº Ïù¥Î¶ÑÏù¥ ÏÑúÎ°ú Îã§Î•∏ Í≤ΩÏö∞
pd.merge(df3, df5, left_on='id', right_on='user_id')

    id  A   B  C    D user_id  E  F   G     H
0  X01  1  11  0  101     X01  2  1  30  1011
1  X02  3  12  1  102     X02  4  2  31  1021
2  X03  5  13  2  103     X03  6  3  32  1031
3  X04  7  14  3  104     X04  8  4  33  1041

# join

In [23]:
df1 = pd.DataFrame({'A': [1,3,5,7,9],
                    'B': [11,12,13,14,15],
                    'C': [0,1,2,3,4],
                    'D': [101,102,103,104,105]},
                  index = [1,2,3,4,5])
df1

   A   B  C    D
1  1  11  0  101
2  3  12  1  102
3  5  13  2  103
4  7  14  3  104
5  9  15  4  105

In [24]:
df2 = pd.DataFrame({'E': [2,4,6,8,10],
                    'F': [1,2,3,4,5],
                    'G': [30,31,32,33,34],
                    'H': [1011,1021,1031,1041,1051]    
},
                  index = [6,7,8,9,10])
df2

     E  F   G     H
6    2  1  30  1011
7    4  2  31  1021
8    6  3  32  1031
9    8  4  33  1041
10  10  5  34  1051

In [25]:
# index Í∏∞Ï§ÄÏúºÎ°ú joinÏù¥ ÏàòÌñâÎê®
df1.join(df2)

   A   B  C    D   E   F   G   H
1  1  11  0  101 NaN NaN NaN NaN
2  3  12  1  102 NaN NaN NaN NaN
3  5  13  2  103 NaN NaN NaN NaN
4  7  14  3  104 NaN NaN NaN NaN
5  9  15  4  105 NaN NaN NaN NaN

In [26]:
# index ÏùºÏπò ÏãúÏºúÏ£ºÍ∏∞
df1.reset_index(drop=True, inplace=True)
df2.reset_index(drop=True, inplace=True)

In [27]:
df1.join(df2)

   A   B  C    D   E  F   G     H
0  1  11  0  101   2  1  30  1011
1  3  12  1  102   4  2  31  1021
2  5  13  2  103   6  3  32  1031
3  7  14  3  104   8  4  33  1041
4  9  15  4  105  10  5  34  1051